{
	"id": 1,
	"name": "Kyle Moses",
	"picture": "http://www.kylemoses.com/img/jpg/me.jpg",
	"role": "Web Developer",
	"employed": true,
	"elevator_speach": "I spent my childhood taking things apart just to put them back together again. Building has always been a part of my inquisitive nature, and now I enjoy it for a living as a web developer. My natural love for trouble-shooting and trained eye for design allow me to offer a versatile skill set. This combination aligned with my passion for what I do puts me a cut above the rest.",
	"skill_set": {
		"core": ["HTML5", "CSS3", "JavaScript", "jQuery", "Ajax", "JSON", "Git", "Wordpress", "Photoshop", "Illustrator"],
		"secondary": ["REST APIs", "Angular.js", "React.js", "Node.js", "Express.js", ".NET", "C#", "UI/UX Design", "Foundation", "Bootstrap"],
		"tertiary": [".JSP", "PHP", "PhoneGap(Cordova)", "MySQL", "Sails.js", "Webpack", "Grunt", "Gulp", "GraphQL", "MongoDB", "Redis"],
		"soft_skills": ["Problem Solving", "Learning Agility", "Attention to Detail", "Self-Motivation", "Communication"]
	},
	"dev_tools": ["Chrome", "Sublime Text 3", "iTerm2", "Cyberduck", "WAMP", "VirtualBox", "XCode", "Sequel Pro"],
	"work-history": [{
		"company": "Express",
		"title": "Web UI Developer",
		"duration": "2 yrs 3 mos",
		"description": "Primary objectives include building new features and functionality for a large scale e-commerce website, Express.com. Focus on long-term projects, architectural decision making, develop reusable object-oriented JavaScript components, consume REST APIs, and craft functional cross-browser, responsive and adaptive UIs. I work on many large scale projects, both internal and customer facing. Including the development of a product mix & match tool, and rebuilding the Express.com product details page with a new technology stack including React.js, Express.js, Node.js. Part of a large agile(scrum) team working through all aspects of the development life-cycle. Daily interaction with the Atlassian ecosystem: Stash, Jira, Bamboo, Confluence. Publish content on varying CMSs like Oracle Commerce(ATG), Adobe Experience Manager, & Wordpress. Utilize front-end frameworks and libraries like jQuery.js, Angular.js, React.js, SASS, Foundation. Collaborate with back-end Java Engineers to deliver solutions. Update & Maintain existing site .JSP(Java Server Pages). Mentor and oversee junior developers and junior projects."
	}, {
		"company": "Book Dog Books",
		"title": "Interactive Designer & Developer",
		"duration": "2 yrs 6 mos",
		"description": "Responsible for both design & development of a suite e-commerce websites including TextbookRush.com, Bookstores.com & Fatbrain.co.uk. Collaborate with other .NET C# developers to build user friendly & cross browser compliant websites. Major projects included creating, designing, developing a game-style customer loyalty program. Developing a hybrid mobile app for TextbookRush.com using Angular.js & PhoneGap(cordova) to publish cross-platform. I Also worked closely with the Marketing Director on the creative direction of HTML emails, flash banner ads, print collateral, package design, general brainstorming, promotional materials, and brand identity development."
	}, {
		"company": "inServ Worldwide",
		"title": "Digital Developer",
		"duration": "1 yrs 2 mos",
		"description": "Responsible for the front-end development of large scale pharmacuetical cross browser compliant, mobile & responsive websites, mobile web applications, iPad sales detailing aids, HTML Emails, Flash banner ads,. Some of the clients I have worked with include Eli Lilly, i3, Ignite, Palio, Inventiv Health, Harvest Tech, and Amylin Pharmaceuticals."
	}],
	"education": [{
		"school": "School of Advertising Art",
		"degree": "Associates Degree of Applied Business in Advertising",
		"grad-year": "2010"
	}],
	"info": {
		"phone": "614-940-1780",
		"email": "moses.kyle@gmail.com",
		"address": ""
	},
	"links": {
		"website": "kylemoses.com",
		"linkedin": "https://www.linkedin.com/in/kylemoses/",
		"github": "https://github.com/kylemoses"
	}
}
